Rajshekhar-EM/IMXRT1050EVK_Bootloader/BD155_P_V1_0_0/NewProject/Target/BSP/iMXRT1052_MIMXRT1050_EVK/Setup_SES/DeviceSupport/system_MIMXRT105x.c
/*
** ###################################################################
**     Processors:          MIMXRT1052CVJ5B
**                          MIMXRT1052CVL5B
**                          MIMXRT1052DVJ6B
**                          MIMXRT1052DVL6B
**
**     Compilers:           Keil ARM C/C++ Compiler
**                          Freescale C/C++ for Embedded ARM
**                          GNU C Compiler
**                          IAR ANSI C/C++ Compiler for ARM
**                          MCUXpresso Compiler
**
**     Reference manual:    IMXRT1050RM Rev.1, 03/2018
**     Version:             rev. 0.1, 2017-01-10
**     Build:               b180509
**
**     Abstract:
**         Provides a system configuration function and a global variable that
**         contains the system frequency. It configures the device and initializes
**         the oscillator (PLL) that is part of the microcontroller device.
**
**     The Clear BSD License
**     Copyright 2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2018 NXP
**     All rights reserved.
**
**     Redistribution and use in source and binary forms, with or without
**     modification, are permitted (subject to the limitations in the
**     disclaimer below) provided that the following conditions are met:
**
**     * Redistributions of source code must retain the above copyright
**       notice, this list of conditions and the following disclaimer.
**
**     * Redistributions in binary form must reproduce the above copyright
**       notice, this list of conditions and the following disclaimer in the
**       documentation and/or other materials provided with the distribution.
**
**     * Neither the name of the copyright holder nor the names of its
**       contributors may be used to endorse or promote products derived from
**       this software without specific prior written permission.
**
**     NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
**     GRANTED BY THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
**     HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
**     WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
**     MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
**     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
**     LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
**     CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
**     SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR
**     BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
**     WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
**     OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN
**     IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2017-01-10)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file MIMXRT1052
 * @version 0.1
 * @date 2017-01-10
 * @brief Device specific configuration file for MIMXRT1052 (implementation file)
 *
 * Provides a system configuration function and a global variable that contains
 * the system frequency. It configures the device and initializes the oscillator
 * (PLL) that is part of the microcontroller device.
 */

#include <stdint.h>
#include "fsl_device_registers.h"

/*********************************************************************
*
*       SFR definitions
*
**********************************************************************
*/
/*********************************************************************
*
*       IOMUX SFRs
*/
#define SW_MUX_CTL_PAD_BASE_ADDR    (0x401F8000uL)
#define SW_MUX_CTL_PAD_GPIO_EMC_00  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x014))
#define SW_MUX_CTL_PAD_GPIO_EMC_01  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x018))
#define SW_MUX_CTL_PAD_GPIO_EMC_02  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x01C))
#define SW_MUX_CTL_PAD_GPIO_EMC_03  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x020))
#define SW_MUX_CTL_PAD_GPIO_EMC_04  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x024))
#define SW_MUX_CTL_PAD_GPIO_EMC_05  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x028))
#define SW_MUX_CTL_PAD_GPIO_EMC_06  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x02C))
#define SW_MUX_CTL_PAD_GPIO_EMC_07  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x030))
#define SW_MUX_CTL_PAD_GPIO_EMC_08  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x034))
#define SW_MUX_CTL_PAD_GPIO_EMC_09  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x038))
#define SW_MUX_CTL_PAD_GPIO_EMC_10  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x03C))
#define SW_MUX_CTL_PAD_GPIO_EMC_11  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x040))
#define SW_MUX_CTL_PAD_GPIO_EMC_12  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x044))
#define SW_MUX_CTL_PAD_GPIO_EMC_13  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x048))
#define SW_MUX_CTL_PAD_GPIO_EMC_14  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x04C))
#define SW_MUX_CTL_PAD_GPIO_EMC_15  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x050))
#define SW_MUX_CTL_PAD_GPIO_EMC_16  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x054))
#define SW_MUX_CTL_PAD_GPIO_EMC_17  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x058))
#define SW_MUX_CTL_PAD_GPIO_EMC_18  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x05C))
#define SW_MUX_CTL_PAD_GPIO_EMC_19  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x060))
#define SW_MUX_CTL_PAD_GPIO_EMC_20  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x064))
#define SW_MUX_CTL_PAD_GPIO_EMC_21  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x068))
#define SW_MUX_CTL_PAD_GPIO_EMC_22  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x06C))
#define SW_MUX_CTL_PAD_GPIO_EMC_23  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x070))
#define SW_MUX_CTL_PAD_GPIO_EMC_24  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x074))
#define SW_MUX_CTL_PAD_GPIO_EMC_25  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x078))
#define SW_MUX_CTL_PAD_GPIO_EMC_26  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x07C))
#define SW_MUX_CTL_PAD_GPIO_EMC_27  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x080))
#define SW_MUX_CTL_PAD_GPIO_EMC_28  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x084))
#define SW_MUX_CTL_PAD_GPIO_EMC_29  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x088))
#define SW_MUX_CTL_PAD_GPIO_EMC_30  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x08C))
#define SW_MUX_CTL_PAD_GPIO_EMC_31  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x090))
#define SW_MUX_CTL_PAD_GPIO_EMC_32  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x094))
#define SW_MUX_CTL_PAD_GPIO_EMC_33  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x098))
#define SW_MUX_CTL_PAD_GPIO_EMC_34  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x09C))
#define SW_MUX_CTL_PAD_GPIO_EMC_35  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0A0))
#define SW_MUX_CTL_PAD_GPIO_EMC_36  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0A4))
#define SW_MUX_CTL_PAD_GPIO_EMC_37  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0A8))
#define SW_MUX_CTL_PAD_GPIO_EMC_38  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0AC))
#define SW_MUX_CTL_PAD_GPIO_EMC_39  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0B0))
#define SW_MUX_CTL_PAD_GPIO_EMC_40  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0B4))
#define SW_MUX_CTL_PAD_GPIO_EMC_41  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x0B8))

/*********************************************************************
*
*       IOMUX PAD SFRs
*/
#define SW_PAD_CTL_PAD_GPIO_EMC_00  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x204))
#define SW_PAD_CTL_PAD_GPIO_EMC_01  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x208))
#define SW_PAD_CTL_PAD_GPIO_EMC_02  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x20C))
#define SW_PAD_CTL_PAD_GPIO_EMC_03  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x210))
#define SW_PAD_CTL_PAD_GPIO_EMC_04  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x214))
#define SW_PAD_CTL_PAD_GPIO_EMC_05  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x218))
#define SW_PAD_CTL_PAD_GPIO_EMC_06  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x21C))
#define SW_PAD_CTL_PAD_GPIO_EMC_07  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x220))
#define SW_PAD_CTL_PAD_GPIO_EMC_08  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x224))
#define SW_PAD_CTL_PAD_GPIO_EMC_09  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x228))
#define SW_PAD_CTL_PAD_GPIO_EMC_10  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x22C))
#define SW_PAD_CTL_PAD_GPIO_EMC_11  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x230))
#define SW_PAD_CTL_PAD_GPIO_EMC_12  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x234))
#define SW_PAD_CTL_PAD_GPIO_EMC_13  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x238))
#define SW_PAD_CTL_PAD_GPIO_EMC_14  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x23C))
#define SW_PAD_CTL_PAD_GPIO_EMC_15  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x240))
#define SW_PAD_CTL_PAD_GPIO_EMC_16  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x244))
#define SW_PAD_CTL_PAD_GPIO_EMC_17  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x248))
#define SW_PAD_CTL_PAD_GPIO_EMC_18  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x24C))
#define SW_PAD_CTL_PAD_GPIO_EMC_19  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x250))
#define SW_PAD_CTL_PAD_GPIO_EMC_20  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x254))
#define SW_PAD_CTL_PAD_GPIO_EMC_21  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x258))
#define SW_PAD_CTL_PAD_GPIO_EMC_22  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x25C))
#define SW_PAD_CTL_PAD_GPIO_EMC_23  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x260))
#define SW_PAD_CTL_PAD_GPIO_EMC_24  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x264))
#define SW_PAD_CTL_PAD_GPIO_EMC_25  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x268))
#define SW_PAD_CTL_PAD_GPIO_EMC_26  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x26C))
#define SW_PAD_CTL_PAD_GPIO_EMC_27  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x270))
#define SW_PAD_CTL_PAD_GPIO_EMC_28  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x274))
#define SW_PAD_CTL_PAD_GPIO_EMC_29  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x278))
#define SW_PAD_CTL_PAD_GPIO_EMC_30  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x27C))
#define SW_PAD_CTL_PAD_GPIO_EMC_31  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x280))
#define SW_PAD_CTL_PAD_GPIO_EMC_32  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x284))
#define SW_PAD_CTL_PAD_GPIO_EMC_33  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x288))
#define SW_PAD_CTL_PAD_GPIO_EMC_34  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x28C))
#define SW_PAD_CTL_PAD_GPIO_EMC_35  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x290))
#define SW_PAD_CTL_PAD_GPIO_EMC_36  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x294))
#define SW_PAD_CTL_PAD_GPIO_EMC_37  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x298))
#define SW_PAD_CTL_PAD_GPIO_EMC_38  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x29C))
#define SW_PAD_CTL_PAD_GPIO_EMC_39  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x2A0))
#define SW_PAD_CTL_PAD_GPIO_EMC_40  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x2A4))
#define SW_PAD_CTL_PAD_GPIO_EMC_41  (*(volatile unsigned int *)(SW_MUX_CTL_PAD_BASE_ADDR + 0x2A8))

/*********************************************************************
*
*       SEMC SFRs
*/
#define SEMC_BASE_ADDR  (0x402F0000uL)
#define SEMC_MCR        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x00))
#define SEMC_IOCR       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x04))
#define SEMC_BMCR0      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x08))
#define SEMC_BMCR1      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x0C))
#define SEMC_BR0        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x10))
#define SEMC_BR1        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x14))
#define SEMC_BR2        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x18))
#define SEMC_BR3        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x1C))
#define SEMC_BR4        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x20))
#define SEMC_BR5        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x24))
#define SEMC_BR6        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x28))
#define SEMC_BR7        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x2C))
#define SEMC_BR8        (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x30))
#define SEMC_INTEN      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x38))
#define SEMC_INTR       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x3C))
#define SEMC_SDRAMCR0   (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x40))
#define SEMC_SDRAMCR1   (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x44))
#define SEMC_SDRAMCR2   (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x48))
#define SEMC_SDRAMCR3   (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x4C))
#define SEMC_NANDCR0    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x50))
#define SEMC_NANDCR1    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x54))
#define SEMC_NANDCR2    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x58))
#define SEMC_NANDCR3    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x5C))
#define SEMC_NORCR0     (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x60))
#define SEMC_NORCR1     (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x64))
#define SEMC_NORCR2     (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x68))
#define SEMC_NORCR3     (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x6C))
#define SEMC_SRAMCR0    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x70))
#define SEMC_SRAMCR1    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x74))
#define SEMC_SRAMCR2    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x78))
#define SEMC_SRAMCR3    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x7C))
#define SEMC_DBICR0     (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x80))
#define SEMC_DBICR1     (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x84))
#define SEMC_IPCR0      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x90))
#define SEMC_IPCR1      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x94))
#define SEMC_IPCR2      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x98))
#define SEMC_IPCMD      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0x9C))
#define SEMC_IPTXDAT    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xA0))
#define SEMC_IPRXDAT    (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xB0))
#define SEMC_STS0       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xC0))
#define SEMC_STS1       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xC4))
#define SEMC_STS2       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xC8))
#define SEMC_STS3       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xCC))
#define SEMC_STS4       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xD0))
#define SEMC_STS5       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xD4))
#define SEMC_STS6       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xD8))
#define SEMC_STS7       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xDC))
#define SEMC_STS8       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xE0))
#define SEMC_STS9       (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xE4))
#define SEMC_STS10      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xE8))
#define SEMC_STS11      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xEC))
#define SEMC_STS12      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xF0))
#define SEMC_STS13      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xF4))
#define SEMC_STS14      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xF8))
#define SEMC_STS15      (*(volatile unsigned int *)(SEMC_BASE_ADDR + 0xFC))

/*********************************************************************
*
*       Clock Controller Module SFRs
*/
#define CCM_BASE_ADDR  (0x400FC000uL)
#define CCM_CACRR      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x010))
#define CCM_CBCDR      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x014))
#define CCM_CBCMR      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x018))
#define CCM_CDHIPR     (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x048))
#define CCM_CCGR0      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x068))
#define CCM_CCGR1      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x06C))
#define CCM_CCGR2      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x070))
#define CCM_CCGR3      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x074))
#define CCM_CCGR4      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x078))
#define CCM_CCGR5      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x07C))
#define CCM_CCGR6      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x080))
#define CCM_CMEOR      (*(volatile unsigned int *)(CCM_BASE_ADDR + 0x088))

