Rajshekhar-EM/IMXRT1050EVK_Bootloader/BD155_P_V1_0_0/NewProject/Target/BSP/iMXRT1052_MIMXRT1050_EVK/Setup_SES/DeviceSupport/system_MIMXRT105x.c
#define CCM_ANALOG_BASE_ADDR  0x400D8000uL
#define CCM_ANALOG_PLL_ARM    (*(volatile unsigned int *)(CCM_ANALOG_BASE_ADDR + 0x000))
#define CCM_ANALOG_PLL_SYS    (*(volatile unsigned int *)(CCM_ANALOG_BASE_ADDR + 0x030))
#define CCM_ANALOG_PFD_528    (*(volatile unsigned int *)(CCM_ANALOG_BASE_ADDR + 0x100))

/*********************************************************************
*
*       DCDC SFRs
*/
#define DCDC_BASE_ADDR  (0x40080000uL)
#define DCDC_REG3       (*(volatile unsigned int *)(DCDC_BASE_ADDR + 0xC))

/*********************************************************************
*
*       _SDRAM_WaitIpCmdDone
*/
static void _SDRAM_WaitIpCmdDone(void) {
  unsigned int reg;

  do {
    reg = SEMC_INTR;
  } while((reg & 0x3) == 0);
}

/*********************************************************************
*
*       _ClockInit
*/
static void _ClockInit(void) {
  //
  // Enable all clocks
  //
  CCM_CCGR0 = 0xffffffff;
  CCM_CCGR1 = 0xffffffff;
  CCM_CCGR2 = 0xffffffff;
  CCM_CCGR3 = 0xffffffff;
  CCM_CCGR4 = 0xffffffff;
  CCM_CCGR5 = 0xffffffff;
  CCM_CCGR6 = 0xffffffff;
  //
  // Initialize clocks
  // ARM clock:        1200MHz
  // AHB/System clock:  600Mhz
  // SDRAM/SEMC:        150MHz
  //
  DCDC_REG3 =  (DCDC_REG3 & 0x1F) | 0x12;  // VDD_SOC to 1,5V in order to config AHB to 600MHz
  //
  // Let the device run on PLL3, so we can configure PLL1
  //
  CCM_CBCDR |=  (1u << 25);  // Switch device to PERIPH_CLK2
  while (CCM_CDHIPR != 0);
  //
  // Initialize PLL1
  //
  CCM_ANALOG_PLL_ARM = 0
                     | (  0u << 16)  // Don't bypass PLL
                     | (  0u << 14)  // Use 24MHZ clock source
                     | (  1u << 13)  // Enable clock output
                     | (  0u << 12)  // Don't power down PLL
                     | (100u <<  0); // Set DIV_SELECT to 100. Fout = Fin * DIV_SELECT / 2 => 1200MHz
  while ((CCM_ANALOG_PLL_ARM & 0x80000000) == 0);
  //
  // Switch back to using PLL1 for the device.
  // Use peripheral clock (600MHz) and divide it by 4 to get 150MHz clock for SEMC.
  //
  CCM_CBCDR = (CCM_CBCDR & ~(1u << 25)) | (3u << 16);
  while (CCM_CDHIPR != 0); 
}

/*********************************************************************
*
*       _SDRAMInit
*/
static void _SDRAMInit(void) {
  //
  // Config IOMUX for SDRAM
  //
  SW_MUX_CTL_PAD_GPIO_EMC_00 = 0x00000000; // EMC_00
  SW_MUX_CTL_PAD_GPIO_EMC_01 = 0x00000000; // EMC_01
  SW_MUX_CTL_PAD_GPIO_EMC_02 = 0x00000000; // EMC_02
  SW_MUX_CTL_PAD_GPIO_EMC_03 = 0x00000000; // EMC_03
  SW_MUX_CTL_PAD_GPIO_EMC_04 = 0x00000000; // EMC_04
  SW_MUX_CTL_PAD_GPIO_EMC_05 = 0x00000000; // EMC_05
  SW_MUX_CTL_PAD_GPIO_EMC_06 = 0x00000000; // EMC_06
  SW_MUX_CTL_PAD_GPIO_EMC_07 = 0x00000000; // EMC_07
  SW_MUX_CTL_PAD_GPIO_EMC_08 = 0x00000000; // EMC_08
  SW_MUX_CTL_PAD_GPIO_EMC_09 = 0x00000000; // EMC_09
  SW_MUX_CTL_PAD_GPIO_EMC_10 = 0x00000000; // EMC_10
  SW_MUX_CTL_PAD_GPIO_EMC_11 = 0x00000000; // EMC_11
  SW_MUX_CTL_PAD_GPIO_EMC_12 = 0x00000000; // EMC_12
  SW_MUX_CTL_PAD_GPIO_EMC_13 = 0x00000000; // EMC_13
  SW_MUX_CTL_PAD_GPIO_EMC_14 = 0x00000000; // EMC_14
  SW_MUX_CTL_PAD_GPIO_EMC_15 = 0x00000000; // EMC_15
  SW_MUX_CTL_PAD_GPIO_EMC_16 = 0x00000000; // EMC_16
  SW_MUX_CTL_PAD_GPIO_EMC_17 = 0x00000000; // EMC_17
  SW_MUX_CTL_PAD_GPIO_EMC_18 = 0x00000000; // EMC_18
  SW_MUX_CTL_PAD_GPIO_EMC_19 = 0x00000000; // EMC_19
  SW_MUX_CTL_PAD_GPIO_EMC_20 = 0x00000000; // EMC_20
  SW_MUX_CTL_PAD_GPIO_EMC_21 = 0x00000000; // EMC_21
  SW_MUX_CTL_PAD_GPIO_EMC_22 = 0x00000000; // EMC_22
  SW_MUX_CTL_PAD_GPIO_EMC_23 = 0x00000000; // EMC_23
  SW_MUX_CTL_PAD_GPIO_EMC_24 = 0x00000000; // EMC_24
  SW_MUX_CTL_PAD_GPIO_EMC_25 = 0x00000000; // EMC_25
  SW_MUX_CTL_PAD_GPIO_EMC_26 = 0x00000000; // EMC_26
  SW_MUX_CTL_PAD_GPIO_EMC_27 = 0x00000000; // EMC_27
  SW_MUX_CTL_PAD_GPIO_EMC_28 = 0x00000000; // EMC_28
  SW_MUX_CTL_PAD_GPIO_EMC_29 = 0x00000000; // EMC_29
  SW_MUX_CTL_PAD_GPIO_EMC_30 = 0x00000000; // EMC_30
  SW_MUX_CTL_PAD_GPIO_EMC_31 = 0x00000000; // EMC_31
  SW_MUX_CTL_PAD_GPIO_EMC_32 = 0x00000000; // EMC_32
  SW_MUX_CTL_PAD_GPIO_EMC_33 = 0x00000000; // EMC_33
  SW_MUX_CTL_PAD_GPIO_EMC_34 = 0x00000000; // EMC_34
  SW_MUX_CTL_PAD_GPIO_EMC_35 = 0x00000000; // EMC_35
  SW_MUX_CTL_PAD_GPIO_EMC_36 = 0x00000000; // EMC_36
  SW_MUX_CTL_PAD_GPIO_EMC_37 = 0x00000000; // EMC_37
  SW_MUX_CTL_PAD_GPIO_EMC_38 = 0x00000000; // EMC_38
  SW_MUX_CTL_PAD_GPIO_EMC_39 = 0x00000010; // EMC_39, DQS PIN, enable SION
  SW_MUX_CTL_PAD_GPIO_EMC_40 = 0x00000000; // EMC_40
  SW_MUX_CTL_PAD_GPIO_EMC_41 = 0x00000000; // EMC_41
  //
  // PAD ctrl drive strength = 0x7 to increase drive strength otherwise the data7 bit may fail.
  //
  SW_PAD_CTL_PAD_GPIO_EMC_00 = 0x000110F9; // EMC_00
  SW_PAD_CTL_PAD_GPIO_EMC_01 = 0x000110F9; // EMC_01
  SW_PAD_CTL_PAD_GPIO_EMC_02 = 0x000110F9; // EMC_02
  SW_PAD_CTL_PAD_GPIO_EMC_03 = 0x000110F9; // EMC_03
  SW_PAD_CTL_PAD_GPIO_EMC_04 = 0x000110F9; // EMC_04
  SW_PAD_CTL_PAD_GPIO_EMC_05 = 0x000110F9; // EMC_05
  SW_PAD_CTL_PAD_GPIO_EMC_06 = 0x000110F9; // EMC_06
  SW_PAD_CTL_PAD_GPIO_EMC_07 = 0x000110F9; // EMC_07
  SW_PAD_CTL_PAD_GPIO_EMC_08 = 0x000110F9; // EMC_08
  SW_PAD_CTL_PAD_GPIO_EMC_09 = 0x000110F9; // EMC_09
  SW_PAD_CTL_PAD_GPIO_EMC_10 = 0x000110F9; // EMC_10
  SW_PAD_CTL_PAD_GPIO_EMC_11 = 0x000110F9; // EMC_11
  SW_PAD_CTL_PAD_GPIO_EMC_12 = 0x000110F9; // EMC_12
  SW_PAD_CTL_PAD_GPIO_EMC_13 = 0x000110F9; // EMC_13
  SW_PAD_CTL_PAD_GPIO_EMC_14 = 0x000110F9; // EMC_14
  SW_PAD_CTL_PAD_GPIO_EMC_15 = 0x000110F9; // EMC_15
  SW_PAD_CTL_PAD_GPIO_EMC_16 = 0x000110F9; // EMC_16
  SW_PAD_CTL_PAD_GPIO_EMC_17 = 0x000110F9; // EMC_17
  SW_PAD_CTL_PAD_GPIO_EMC_18 = 0x000110F9; // EMC_18
  SW_PAD_CTL_PAD_GPIO_EMC_19 = 0x000110F9; // EMC_19
  SW_PAD_CTL_PAD_GPIO_EMC_20 = 0x000110F9; // EMC_20
  SW_PAD_CTL_PAD_GPIO_EMC_21 = 0x000110F9; // EMC_21
  SW_PAD_CTL_PAD_GPIO_EMC_22 = 0x000110F9; // EMC_22
  SW_PAD_CTL_PAD_GPIO_EMC_23 = 0x000110F9; // EMC_23
  SW_PAD_CTL_PAD_GPIO_EMC_24 = 0x000110F9; // EMC_24
  SW_PAD_CTL_PAD_GPIO_EMC_25 = 0x000110F9; // EMC_25
  SW_PAD_CTL_PAD_GPIO_EMC_26 = 0x000110F9; // EMC_26
  SW_PAD_CTL_PAD_GPIO_EMC_27 = 0x000110F9; // EMC_27
  SW_PAD_CTL_PAD_GPIO_EMC_28 = 0x000110F9; // EMC_28
  SW_PAD_CTL_PAD_GPIO_EMC_29 = 0x000110F9; // EMC_29
  SW_PAD_CTL_PAD_GPIO_EMC_30 = 0x000110F9; // EMC_30
  SW_PAD_CTL_PAD_GPIO_EMC_31 = 0x000110F9; // EMC_31
  SW_PAD_CTL_PAD_GPIO_EMC_32 = 0x000110F9; // EMC_32
  SW_PAD_CTL_PAD_GPIO_EMC_33 = 0x000110F9; // EMC_33
  SW_PAD_CTL_PAD_GPIO_EMC_34 = 0x000110F9; // EMC_34
  SW_PAD_CTL_PAD_GPIO_EMC_35 = 0x000110F9; // EMC_35
  SW_PAD_CTL_PAD_GPIO_EMC_36 = 0x000110F9; // EMC_36
  SW_PAD_CTL_PAD_GPIO_EMC_37 = 0x000110F9; // EMC_37
  SW_PAD_CTL_PAD_GPIO_EMC_38 = 0x000110F9; // EMC_38
  SW_PAD_CTL_PAD_GPIO_EMC_39 = 0x000110F9; // EMC_39
  SW_PAD_CTL_PAD_GPIO_EMC_40 = 0x000110F9; // EMC_40
  SW_PAD_CTL_PAD_GPIO_EMC_41 = 0x000110F9; // EMC_41
  //
  // Set up SEMC
  //
  SEMC_MCR      = 0x10000004;
  SEMC_BMCR0    = 0x00030524;
  SEMC_BMCR1    = 0x06030524;
  SEMC_BR0      = 0x8000001B;
  SEMC_BR1      = 0x00000000;
  SEMC_BR2      = 0x00000000;
  SEMC_BR3      = 0x00000000;
  SEMC_BR4      = 0x00000000;
  SEMC_BR5      = 0x00000000;
  SEMC_BR6      = 0x00000000;
  SEMC_BR7      = 0x00000000;
  SEMC_BR8      = 0x00000000;
  SEMC_IOCR     = 0x000079A8;
  SEMC_SDRAMCR0 = 0x00000F31;
  SEMC_SDRAMCR1 = 0x00652922;
  SEMC_SDRAMCR2 = 0x00010920;
  SEMC_SDRAMCR3 = 0x50210A08;
  SEMC_DBICR0   = 0x00000021;
  SEMC_DBICR1   = 0x00888888;
  SEMC_IPCR1    = 0x00000002;
  SEMC_IPCR2    = 0x00000000;
  SEMC_IPCR0    = 0x80000000;
  SEMC_IPCMD    = 0xA55A000F;
  _SDRAM_WaitIpCmdDone();
  SEMC_IPCR0    = 0x80000000;
  SEMC_IPCMD    = 0xA55A000C;
  _SDRAM_WaitIpCmdDone();
  SEMC_IPCR0    = 0x80000000;
  SEMC_IPCMD    = 0xA55A000C;
  _SDRAM_WaitIpCmdDone();
  SEMC_IPTXDAT  = 0x00000033;
  SEMC_IPCR0    = 0x80000000;
  SEMC_IPCMD    = 0xA55A000A;
  _SDRAM_WaitIpCmdDone();
  SEMC_SDRAMCR3 = 0x50210A09;
}

/* ----------------------------------------------------------------------------
   -- Core clock
   ---------------------------------------------------------------------------- */

uint32_t SystemCoreClock = DEFAULT_SYSTEM_CLOCK;

/* ----------------------------------------------------------------------------
   -- SystemInit()
   ---------------------------------------------------------------------------- */

void SystemInit (void) {
#if ((__FPU_PRESENT == 1) && (__FPU_USED == 1))
  SCB->CPACR |= ((3UL << 10*2) | (3UL << 11*2));    /* set CP10, CP11 Full Access */
#endif /* ((__FPU_PRESENT == 1) && (__FPU_USED == 1)) */

#if defined(__MCUXPRESSO)
    extern uint32_t g_pfnVectors[];  // Vector table defined in startup code
    SCB->VTOR = (uint32_t)g_pfnVectors;
#endif

/* Watchdog disable */
#if (DISABLE_WDOG)
    if (WDOG1->WCR & WDOG_WCR_WDE_MASK)
    {
        WDOG1->WCR &= ~WDOG_WCR_WDE_MASK;
    }
    if (WDOG2->WCR & WDOG_WCR_WDE_MASK)
    {
        WDOG2->WCR &= ~WDOG_WCR_WDE_MASK;
    }
    RTWDOG->CNT = 0xD928C520U; /* 0xD928C520U is the update key */
    RTWDOG->TOVAL = 0xFFFF;
    RTWDOG->CS = (uint32_t) ((RTWDOG->CS) & ~RTWDOG_CS_EN_MASK) | RTWDOG_CS_UPDATE_MASK;
#endif /* (DISABLE_WDOG) */

